#include "adc.h"
//----------------------------------------
extern unsigned int adc_value;
//----------------------------------------
char high_adc=0,low_adc=0;
//----------------------------------------
ISR(ADC_vect)
{
	low_adc = ADCL;
	high_adc = ADCH;//Верхняя часть регистра ADC должна быть считана последней, иначе не продолжится преобразование
	adc_value = high_adc*256+low_adc;
}
void ADC_Init(void)
{	
	ADCSRA |= (1<<ADEN) // Разрешение использования АЦП
	|(1<<ADSC)//Запуск преобразования
	|(1<<ADATE)//Непрерывный режим работы АЦП
	|(1<<ADPS2)|(1<<ADPS1)|(1<<ADPS0)//Делитель 128 = 125 кГц
	|(1<<ADIE);//Разрешение прерывания от АЦП
	ADMUX |= (1<<REFS0)|(1<<MUX1)|(1<<MUX0); // ИОН=AVcc, вход ADC0 |(1<<MUX1)|(1<<MUX0)
}